Revit 2024 API
AnalyticalBusData Class
 Represents the data and parameters of analytical bus node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalBusData : AnalyticalDistributionNodePropertyData
Visual Basic
Public Class AnalyticalBusData _
	Inherits AnalyticalDistributionNodePropertyData
Visual C++
public ref class AnalyticalBusData : public AnalyticalDistributionNodePropertyData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalBusData
See Also
AnalyticalBusData Members
Autodesk.Revit.DB.Electrical Namespace